ons.bootstrap()
    .controller('AppController', function() {
        this.name;
        this.exp;
        this.menus = [
            ['ローマ皇帝', 'a001'],
            ['フランス王', 'a002'],
            ['イングランド王', 'a003'],
            ['神聖ローマ帝国皇帝', 'a004']
        ];
        this.romans = [
            ["アウグストゥス", "アウグストゥスの説明"],
            ["ティベリウス","ティベリウスの説明"],
            ["カリグラ","カリグラの説明"],
            ["クラウディウス","クラウディウスの説明"],
            ["ネロ","ネロの説明"],
            ["ガルバ","ガルバの説明"],
            ["オト", "オトの説明"],
            ["ウィテッリウス","ウィテッリウスの説明"],
            ["ウェスパシアヌス","ウェスパシアヌスの説明"],
            ["ティトゥス","ティトゥスの説明"],
            ["ドミティアヌス","ドミティアヌスの説明"],
            ["ネルウァ","ネルウァの説明"],
            ["トラヤヌス","トラヤヌスの説明"],
            ["ハドリアヌス","ハドリアヌスの説明"],
            ["アントニヌス・ピウス","アントニヌス・ピウスの説明"],
            ["マルクス・アウレリウス","マルクス・アウレリウスの説明"],
            ["コンモドゥス","コンモドゥスの説明"],
            ["ペルティナクス","ペルティナクスの説明"],
            ["ディディウス・ユリアヌス","ディディウス・ユリアヌスの説明"],
            ["セプティミウス・セウェルス","セプティミウス・セウェルスの説明"],
            ["カラカラ","カラカラの説明"],
            ["マクリヌス","マクリヌスの説明"],
            ["ヘリオガバルス","ヘリオガバルスの説明"],
            ["アレクサンデル・セウェルス","アレクサンデル・セウェルスの説明"],
            ["マクシミヌス・トラクス","マクシミヌス・トラクスの説明"]
        ];
        this.pushCrownPage = function (id) {
            navi.pushPage(id + '.html', { animation: "slide" });
        };
        this.showDedtail = function(name, exp) {
            this.name = name;
            this.exp = exp;
            navi.pushPage('detail.html', { animation: "slide" });
        };
    });
ons.ready(function() {
    console.log("Onsen UI is ready!");
});